# ============================================================
# 1. Placement
# ============================================================

global_placement -routability_driven
set_placement_padding -global -left 1

detailed_placement
