# ============================================================
# 1. Placement
# ============================================================

set_placement_padding -global -left 1
global_placement -routability_driven

detailed_placement
